{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-item_description",
    "2": "I-item_description",
    "3": "B-quantity",
    "4": "I-quantity",
    "5": "B-unit_price",
    "6": "I-unit_price",
    "7": "B-line_total",
    "8": "I-line_total",
    "9": "B-tax",
    "10": "I-tax",
    "11": "B-position",
    "12": "I-position",
    "13": "B-article_number",
    "14": "I-article_number"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-article_number": 13,
    "B-item_description": 1,
    "B-line_total": 7,
    "B-position": 11,
    "B-quantity": 3,
    "B-tax": 9,
    "B-unit_price": 5,
    "I-article_number": 14,
    "I-item_description": 2,
    "I-line_total": 8,
    "I-position": 12,
    "I-quantity": 4,
    "I-tax": 10,
    "I-unit_price": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
